<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>production</string>
	</array>
	<key>category</key>
	<string>DEP</string>
	<key>description</key>
	<string></string>
	<key>developer</key>
	<string></string>
	<key>display_name</key>
	<string></string>
	<key>installed_size</key>
	<integer>12651</integer>
	<key>installer_item_hash</key>
	<string>7e9f0b6a2a6fd5ac8243323ab92b212c807f1e0cbeb2fc736a8c828baf101a55</string>
	<key>installer_item_location</key>
	<string>crypt-3.1.0.119.pkg</string>
	<key>installer_item_size</key>
	<integer>4496</integer>
	<key>minimum_os_version</key>
	<string>10.5.0</string>
	<key>name</key>
	<string>crypt</string>
	<key>receipts</key>
	<array>
		<dict>
			<key>installed_size</key>
			<integer>12651</integer>
			<key>packageid</key>
			<string>com.grahamgilbert.Crypt</string>
			<key>version</key>
			<string>3.1.0.119</string>
		</dict>
	</array>
	<key>unattended_install</key>
	<true/>
	<key>unattended_uninstall</key>
	<true/>
	<key>uninstall_method</key>
	<string>removepackages</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>3.1.0.119</string>
</dict>
</plist>
